{"recipes": [{"url": "https://www.allrecipes.com/recipe/144760/butternut-squash-risotto/", "name": "Butternut Squash Risotto", "ingredients": ["2 cups cubed butternut squash ", "2 tablespoons butter ", "\\u00bd onion, minced ", "1 cup Arborio rice ", "\\u2153 cup dry white wine ", "5 cups hot chicken stock ", "\\u00bc cup grated Parmesan cheese ", " salt and ground black pepper to taste "], "directions": ["Place squash cubes into a steamer basket in a saucepan. Add water, cover, and bring to a boil over medium-high heat. Allow to steam until the squash is tender (10 to 15 minutes), then drain, and mash in a bowl with a fork.", "Melt butter in a saucepan over medium-high heat. Add onion; cook and stir for 2 minutes until the onion begins to soften, then stir in the rice. Continue cooking and stirring until the rice is glossy from the butter, and the onion begins to brown on the edges, about 5 minutes more.", "Pour in the white wine; cook, stirring constantly, until it has evaporated. Stir in the mashed squash and 1/3 of the hot chicken stock; reduce heat to medium. Cook and stir until the chicken stock has been absorbed by the rice, 5 to 7 minutes. Add half of the remaining chicken stock, and continue stirring until it has been absorbed. Finally, pour in the remaining stock, and continue stirring until the risotto is creamy. Finish by stirring in the Parmesan cheese, and seasoning to taste with salt and pepper."]}, {"url": "https://www.allrecipes.com/recipe/145194/grilled-yams/", "name": "Grilled Yams", "ingredients": ["1 large yam, peeled and cut into 1/2 inch thick slices ", " olive oil-flavored cooking spray ", " salt to taste ", "1 tablespoon butter "], "directions": ["Preheat a grill for high heat. When the grill is hot, lightly oil the grate. Coat the strips of yam with olive oil cooking spray and season with salt.", "Arrange the yam strips on the grate crosswise so they don't fall through. Cook for 10 to 12 minutes per side, until tender and glazed. Serve with butter."]}, {"url": "https://www.allrecipes.com/recipe/145197/blue-cheese-herb-spread/", "name": "Blue Cheese Herb Spread", "ingredients": ["2 tablespoons walnuts ", "2 tablespoons chopped fresh parsley ", "2 tablespoons chopped chives ", "1 (8 ounce) package cream cheese, softened ", "\\u00bd cup blue cheese, crumbled "], "directions": ["Place the walnuts, parsley, and chives in the bowl of a food processor, and process until finely chopped. Place herb mixture into a small bowl, and stir in blue cheese. Set aside.", "Place the cream cheese in the bowl of a food processor, and process until smooth. Add the herb mixture to the cream cheese, and process until thoroughly blended. Serve at room temperature."]}, {"url": "https://www.allrecipes.com/recipe/282892/vegetarian-black-eyed-peas/", "name": "Vegetarian Black-Eyed Peas", "ingredients": ["1 pound dry black-eyed peas ", "4 tablespoons olive oil ", "1 medium onion, chopped ", "2 cloves garlic, minced ", "1 quart water, or more as needed ", "\\u00bd cup chopped green onion tops ", "\\u00bd cup dried parsley flakes ", "3 leaf (blank)s bay leaves ", "1\\u2009\\u00bd tablespoons salt, or more to taste ", " ground black pepper to taste "], "directions": ["Place peas into a large container and cover with several inches of cool water; let soak, 8 hours to overnight. Drain.", "Heat olive oil in a Dutch oven over medium heat. Saute onion and garlic in the hot oil until tender, 5 to 7 minutes. Add black-eyed peas, 1 quart water, green onions, parsley, bay leaves, 1 1/2 tablespoons salt, and pepper; bring to a boil.", "Reduce heat and simmer until peas are tender and most, if not all, water is absorbed, 1 to 2 hours. Add more water if more cooking is needed. Taste and adjust salt and pepper if needed before serving."]}, {"url": "https://www.allrecipes.com/recipe/213030/avocado-and-black-eyed-pea-salsa/", "name": "Avocado and Black Eyed Pea Salsa", "ingredients": ["2 ripe but firm avocados, diced ", "\\u00bd cup chopped green onion ", "\\u00bd cup chopped fresh cilantro ", "1 cup chopped roma (plum) tomatoes ", "1 (11 ounce) can shoepeg corn, drained ", "1 (15 ounce) can black-eyed peas, rinsed and drained ", "\\u00bc cup red wine vinegar ", "\\u00bc cup olive oil ", "1 teaspoon ground cumin ", "\\u00bd teaspoon minced garlic ", " salt and black pepper to taste "], "directions": ["Lightly mix together avocados, green onion, cilantro, tomatoes, corn, and black-eyed peas in a salad bowl until well combined.", "Whisk together red wine vinegar, olive oil, cumin, and minced garlic in a bowl, and pour over the salad. Season to taste with salt and pepper, and lightly toss the salad again. Chill for 1 hour before serving, to blend the flavors."]}, {"url": "https://www.allrecipes.com/recipe/281563/grilled-red-snapper-with-lemon-and-jalapeno/", "name": "Grilled Red Snapper with Lemon and Jalapeno", "ingredients": ["6 (5 ounce) red snapper fillets ", "1 (8 ounce) bottle Italian-style salad dressing ", "1 serving cooking spray ", "1 lemon, thinly sliced ", "1 jalapeno pepper, thinly sliced "], "directions": ["Place snapper fillets in a glass baking dish and pour Italian dressing over top. Gently turn fish to evenly coat. Cover the dish with plastic wrap and marinate in the refrigerator, 8 hours to overnight.", "Preheat an outdoor grill for medium heat. Make a tray with aluminum foil and spray with cooking spray.", "Remove fish from the dressing and place on the foil tray. Place lemon slices and jalapenos on top. Discard any remaining dressing.", "Place the tray on the preheated grill and cook until fish begins to turn a nice, light color and flakes easily with a fork, 5 to 6 minutes per side."]}, {"url": "https://www.allrecipes.com/recipe/145757/kohlrabi-with-white-sauce/", "name": "Kohlrabi with White Sauce", "ingredients": ["4 medium (blank)s kohlrabi bulbs, peeled and cubed ", "\\u00bd teaspoon salt ", "2 tablespoons butter ", "2 tablespoons all-purpose flour ", "1 cup milk ", "3 tablespoons cream ", "1 teaspoon salt ", "1 teaspoon ground nutmeg ", "2 teaspoons white pepper ", "\\u00bd bunch fresh parsley, chopped "], "directions": ["Place the kohlrabi and 1/2 teaspoon salt in a saucepan. Cover with water, and bring to a boil over medium-high heat. Cook until kohlrabi can be pierced with a fork, but remains firm, about 5 minutes. Drain, reserving 1 cup of cooking water. Place kohlrabi in a bowl, and cover.", "Place the butter into the same saucepan, and melt over medium heat. Whisk in the flour, and stir until the mixture becomes paste-like and golden brown. Gradually whisk the milk and reserved cooking water from the kohlrabi into the flour mixture, stirring until thick and smooth. Stir in the cream, 1 teaspoon salt, nutmeg, white pepper, and parsley until well blended. Continue whisking until sauce thickens, then cook 10 minutes more. Stir in the kohlrabi, tossing to coat evenly with sauce."]}, {"url": "https://www.allrecipes.com/recipe/282646/summery-black-eyed-pea-salad/", "name": "Summery Black-Eyed Pea Salad", "ingredients": ["6 (15 ounce) cans black-eyed peas, rinsed and drained ", "1 bunch celery, finely chopped ", "2 medium red bell peppers, finely chopped ", "2 medium yellow bell peppers, finely chopped ", "1 large red onion, finely chopped ", "3 bunches fresh cilantro, finely chopped ", "\\u00be cup extra-virgin olive oil ", "\\u00bd cup lemon juice, or more to taste ", "3 tablespoons minced garlic ", "2 tablespoons garlic powder ", "1 tablespoon lemon zest ", " salt and ground black pepper to taste "], "directions": ["Mix black-eyed peas, celery, bell peppers, onion, and cilantro together in a bowl.", "Whisk olive oil, lemon juice, garlic, garlic powder, salt, and pepper together in a separate bowl. Toss dressing into beans and vegetables.", "For best flavor, refrigerate for at least 4 hours before serving."]}, {"url": "https://www.allrecipes.com/recipe/145815/roasted-red-pepper-tapenade/", "name": "Roasted Red Pepper Tapenade", "ingredients": ["1 (7 ounce) jar roasted red peppers, drained and chopped ", "1 (6 ounce) jar marinated artichoke hearts, drained and chopped ", "\\u00bd cup minced fresh cilantro ", "\\u00bd cup freshly grated Parmesan cheese ", "\\u2153 cup olive oil ", "\\u00bc cup drained capers ", "4 cloves garlic, chopped ", "1 tablespoon fresh lemon juice ", " salt and pepper to taste "], "directions": ["In the bowl of a food processor, combine the red peppers, artichoke hearts, cilantro, Parmesan cheese, olive oil, capers, garlic, and lemon juice. Pulse until finely chopped and the mixture is blended. Transfer to a serving bowl and season to taste with salt and pepper. Cover and refrigerate for at least 2 hours before serving to blend the flavors."]}, {"url": "https://www.allrecipes.com/recipe/146000/lime-cilantro-rice/", "name": "Lime Cilantro Rice", "ingredients": ["2 cups water ", "1 tablespoon butter ", "1 cup long-grain white rice ", "1 teaspoon lime zest ", "2 tablespoons fresh lime juice ", "\\u00bd cup chopped cilantro "], "directions": ["Bring the water to a boil; stir the butter and rice into the water. Cover, reduce heat to low, and simmer until the rice is tender, about 20 minutes.", "Stir the lime zest, lime juice, and cilantro into the cooked rice just before serving."]}, {"url": "https://www.allrecipes.com/recipe/146022/perfect-pita-chips/", "name": "Perfect Pita Chips", "ingredients": ["1 package pita pockets ", "2 tablespoons olive oil ", "1 tablespoon garlic powder ", "1 teaspoon kosher salt ", "1 teaspoon garlic salt "], "directions": ["Preheat oven to 350 degrees F (175 degrees C).", "Brush one side of each piece pita pocket with olive oil. Sprinkle the garlic powder, salt, and garlic salt over the pita pockets. Slice each pocket into 4 even triangles.", "Bake in preheated oven until the triangles turn a light brown color, 15 to 20 minutes."]}, {"url": "https://www.allrecipes.com/recipe/146100/lemon-parsley-green-beans/", "name": "Lemon-Parsley Green Beans", "ingredients": ["1 pinch white sugar ", "1 pound fresh green beans, trimmed ", "2 tablespoons butter ", "2 teaspoons olive oil ", "3 cloves garlic, minced ", "1 tablespoon lemon zest ", "\\u00bc cup chopped fresh parsley ", " salt and pepper to taste ", "1 lemon, cut into wedges "], "directions": ["Bring a large pot of salted water to a boil over high heat: add sugar, and beans. Cook until beans are bright green and tender, 3 to 5 minutes. Drain, and place in a large bowl of ice water to stop cooking.", "Combine the butter and olive oil in a large skillet over medium-high heat; cook until butter melts. Stir in the garlic; cook until pale beige and fragrant. Stir in the beans; cook until wilted, and garlic is dark brown, about 4 minutes. Toss beans with parsley and lemon zest, and cook 1 to 2 minutes more. Season to taste with salt and pepper. Transfer beans to a serving dish, and garnish with lemon wedges."]}, {"url": "https://www.allrecipes.com/recipe/285487/chocolate-raspberry-cake/", "name": "Chocolate-Raspberry Cake", "ingredients": [" baking spray ", "1 teaspoon cocoa powder, or as needed ", "1 teaspoon all-purpose flour, or as needed ", "1 (15.25 ounce) package chocolate cake mix ", "1 cup water ", "1 (6 ounce) container vanilla yogurt ", "1 (3.9 ounce) package instant chocolate pudding mix ", "\\u2153 cup vanilla-flavored vodka ", "\\u2153 cup vegetable oil ", "3 large eggs ", "\\u00bd (12 ounce) package miniature chocolate chips, or more to taste ", "12 ounces fresh raspberries, or more to taste ", "\\u2153 cup white sugar ", "1 (16 ounce) container prepared vanilla frosting ", "1 (8 ounce) container frozen nondairy whipped topping, thawed ", "3 (1 ounce) squares white chocolate, melted and cooled "], "directions": ["Preheat the oven to 350 degrees F (175 degrees C). Grease two 9-inch round cake pans with baking spray. Mix cocoa and flour together and use to flour the pans.", "Combine cake mix, water, vanilla yogurt, pudding mix, vodka, vegetable oil, and eggs in a large bowl. Mix on low speed until moistened. Mix on medium speed for 2 minutes, then stir in chocolate chips. Divide batter evenly into the prepared cake pans.", "Bake in the preheated oven until the centers spring back at your touch, 40 to 50 minutes. Cool in the pans for 5 minutes. Run a table knife around the edges to loosen. Invert carefully onto a serving plate or cooling rack and let cool completely, about 25 minutes.", "Meanwhile, combine raspberries and sugar for filling in a saucepan over medium heat. Cook, stirring frequently, until they reduce by about 50%. Set aside to cool.", "Slice each cooled cake layer horizontally into two layers. Place the bottom layer on a serving plate and top with 1/3 of the filling. Repeat with 2 more layers and remaining filling. Top with final layer.", "Combine vanilla frosting, whipped topping, and melted white chocolate in a large mixing bowl; mix on high speed until smooth and creamy.", "Frost the top and sides of the cake. Decorate with extra chocolate chips and/or raspberries, if desired. Chill for at least 1 hour before serving."]}, {"url": "https://www.allrecipes.com/recipe/146143/buckwheat-and-bacon-side-dish/", "name": "Buckwheat and Bacon Side Dish", "ingredients": ["1 teaspoon olive oil ", "2 shallots, finely chopped ", "1 clove garlic, minced ", "2 bacon strips, chopped ", "\\u00bc cup uncooked medium roasted buckwheat groats ", "\\u00be cup chicken stock ", "\\u2153 cup coarsely chopped flat-leaf parsley ", " salt and coarsely ground pepper to taste "], "directions": ["Heat the olive oil in a saucepan over medium heat. Stir in the shallots and garlic; cook until softened and light brown. Add the bacon pieces and buckwheat; cook and stir until the buckwheat turns orangeish brown, about 5 minutes.", "Add the stock and bring to a boil over medium-high heat. Reduce the heat to low and simmer gently until the liquid is absorbed and the buckwheat is tender,13 to 15 minutes. Toss with the parsley, and season to taste with salt and pepper. Serve immediately."]}, {"url": "https://www.allrecipes.com/recipe/146268/garlic-lovers-shrimp-and-green-bean-salad/", "name": "Garlic Lover's Shrimp and Green Bean Salad", "ingredients": ["4 large cloves garlic, peeled ", "\\u00bc cup olive oil ", "2 tablespoons key lime juice ", "2 sprigs fresh rosemary leaves ", "\\u00bd teaspoon garlic salt ", "20 large shrimp, peeled and deveined ", "1 pound fresh green beans, trimmed ", "\\u00bc cup olive oil ", "1 clove garlic, minced ", "\\u00bd onion, thinly sliced ", "\\u00bd teaspoon garlic salt ", "\\u00bd teaspoon cracked black pepper ", "\\u00bd cup crumbled garlic and herb feta cheese "], "directions": ["Place garlic cloves, 1/4 cup olive oil, key lime juice, rosemary, and 1/2 teaspoon garlic salt into a blender; puree until smooth. Combine shrimp and marinade in a resealable plastic bag. Marinate at least 30 minutes in the refrigerator.", "Place an oven rack in the topmost position and preheat oven on the broil setting.", "Pour the shrimp and their marinade onto a baking sheet lined with aluminum foil. Broil in preheated oven 3 to 4 minutes per side until the shrimp are opaque. Once cooked, pour everything into a bowl and place into refrigerator.", "Meanwhile, bring a large pot of lightly salted water to a boil. Add green beans and cook for 2 to 3 minutes, until tender; drain and rinse with cold water. Drain excess water from the chilled beans and place into a large bowl.", "Heat remaining 1/4 cup olive oil in a large skillet over medium heat. Stir in minced garlic and onion, cook until the onion has softened and turned translucent. Pour the oil over the beans, add shrimp mixture, and toss. Season with garlic salt, and pepper; mix well. Cover and refrigerate at least 1 hour. Mix in crumbled feta before serving."]}, {"url": "https://www.allrecipes.com/recipe/283451/fresh-fig-and-walnut-cookies/", "name": "Fresh Fig and Walnut Cookies", "ingredients": ["2 cups white sugar ", "1 cup butter-flavored shortening (such as Crisco\\u00ae) ", "2 teaspoons vanilla extract ", "4 large eggs ", "4 cups all-purpose flour ", "2 teaspoons baking soda ", "2 teaspoons baking powder ", "1\\u2009\\u00bc teaspoons ground cloves ", "1 teaspoon salt ", "2\\u2009\\u00bd cups chopped fresh figs ", "1 cup chopped walnuts "], "directions": ["Preheat the oven to 350 degrees F (175 degrees C). Lightly grease a cookie sheet.", "Cream sugar, shortening, and vanilla together in a mixing bowl. Add eggs, one at a time, mixing well after each addition.", "Sift flour, baking soda, baking powder, cloves, and salt together in a separate bowl. Add to the wet ingredients and mix until blended; mixture will be a little dry. Stir in figs and walnuts; mixture will get added moisture from the figs. Use a medium cookie scoop to drop spoonfuls of batter onto the prepared cookie sheet.", "Bake in the preheated oven until edges start to brown, 12 to 13 minutes. Cool on the baking sheet for 1 minute before removing to a wire rack to cool completely. Repeat to scoop and bake remaining batches."]}, {"url": "https://www.allrecipes.com/recipe/283985/garlic-butter-rice-casserole/", "name": "Garlic Butter Rice Casserole", "ingredients": ["\\u00bd cup unsalted butter ", "1 cup uncooked long grain rice ", "3 cloves garlic, diced ", "1 teaspoon salt ", "2 cubes chicken bouillon ", "2 cups boiling water "], "directions": ["Preheat the oven to 350 degrees F (175 degrees C). Melt butter in an oven-proof dish in the oven while it preheats, about 10 minutes.", "Remove dish from the oven and add rice, garlic, and salt. Return to the oven for 5 minutes.", "Dissolve bouillon cubes in the boiling water, then add to the rice mixture. Return to the oven and bake, uncovered, until water is absorbed and rice is tender, about 20 minutes."]}, {"url": "https://www.allrecipes.com/recipe/146568/halibut-with-vegetables/", "name": "Halibut with Vegetables", "ingredients": ["2 pounds halibut fillets ", " salt and pepper to taste ", "\\u00bc cup olive oil ", "\\u00bd cup chopped fresh parsley ", "1 yellow onion, thinly sliced ", "2 stalks celery, chopped ", "1 green bell pepper, chopped ", "1 (16 ounce) can diced tomatoes ", "2 tablespoons capers ", "4 cloves garlic, minced "], "directions": ["Preheat oven to 425 degrees F (220 degrees C).", "Wash halibut and pat dry. Cut into serving size pieces, and place in a 9x13 inch baking pan. Sprinkle with salt and pepper. Stir together the olive oil, parsley, onion, celery, bell pepper, tomatoes, capers, and garlic; pour over the halibut.", "Bake until halibut is slightly opaque in the center, about 20 minutes. Remove from oven; let stand for 10 minutes before serving."]}, {"url": "https://www.allrecipes.com/recipe/222720/grilled-romaine/", "name": "Grilled Romaine", "ingredients": ["1 tablespoon olive oil ", "1 head romaine lettuce, cut in half lengthwise ", "1 tablespoon steak seasoning ", "1 lemon, juiced "], "directions": ["Preheat grill for medium heat and lightly oil the grate. Drizzle olive oil over romaine lettuce and season with steak seasoning.", "Place lettuce cut side-down on preheated grill. Cook until lettuce is slightly wilted and charred, about 5 minutes. Drizzle with lemon juice to serve."]}, {"url": "https://www.allrecipes.com/recipe/284079/arroz-a-la-cubana-giniling/", "name": "Arroz a la Cubana (Giniling)", "ingredients": ["1 tablespoon vegetable oil ", "1 medium potato, peeled and diced ", "1 medium carrot, diced ", "\\u00bd medium onion, diced, or to taste ", "2 cloves garlic, minced, or to taste ", "1 pound ground beef ", "\\u00bc cup water ", "2 tablespoons soy sauce ", " salt and ground black pepper to taste ", "1 medium bell pepper, diced ", "2 tablespoons raisins ", "2 tablespoons peas ", "2 cups hot cooked rice "], "directions": ["Heat oil in a large skillet over medium heat. Add potato and carrot; saute for 3 minutes. Remove to a bowl.", "Add onion and garlic to the hot skillet and saute until slightly brown, 5 to 7 minutes. Add ground beef; cook and stir until browned and crumbly, 5 to 7 minutes. Add potato-carrot mixture back to the skillet with water, soy sauce, salt, and pepper. Cover and simmer until potatoes are tender, 5 to 8 minutes.", "Add bell pepper, raisins, and peas; cook until heated through, about 2 minutes. Serve over hot rice."]}, {"url": "https://www.allrecipes.com/recipe/146689/favorite-topped-deviled-eggs/", "name": "Favorite Topped Deviled Eggs", "ingredients": ["12 hard-cooked eggs ", "\\u00bd (8 ounce) package PHILADELPHIA Neufchatel Cheese, 1/3 Less Fat than Cream Cheese, softened ", "3 tablespoons KRAFT Mayo Light Mayonnaise ", "2 teaspoons GREY POUPON Dijon Mustard ", "2 teaspoons white vinegar ", "1 teaspoon sugar ", "\\u215b teaspoon paprika "], "directions": ["Cut eggs in half lengthwise. Remove yolks; place in medium bowl. Add Neufchatel cheese, mayo, mustard, vinegar and sugar; mix until well blended.", "Spoon mixture into large resealable plastic bag. Cut small corner from bag and pipe filling into egg white halves. Sprinkle with paprika.", "Add, if desired, your choice of Toppings (see Tips) just before serving."]}, {"url": "https://www.allrecipes.com/recipe/281964/fruit-burritos/", "name": "Fruit Burritos", "ingredients": ["1 cup vegetable oil for frying, or as needed ", "\\u2153 cup white sugar ", "1 tablespoon ground cinnamon ", "\\u00be cup peach pie filling ", "12 (6 inch) flour tortillas "], "directions": ["Heat oil in a deep saucepan over medium heat. Mix sugar and cinnamon together in a brown paper bag.", "Put about 1 tablespoon pie filling in the center of each tortilla and roll up like a burrito, folding both ends over.", "Lower burritos carefully into the hot oil in batches. Fry until medium brown and crispy, turning once, 3 to 5 minutes. Transfer to a plate lined with paper towels to drain and then shake in the paper bag until coated with cinnamon-sugar mixture. Repeat with remaining burritos."]}, {"url": "https://www.allrecipes.com/recipe/281457/maple-glazed-pork-chops/", "name": "Maple-Glazed Pork Chops", "ingredients": ["2 tablespoons salted butter ", "1 cup maple syrup ", "\\u00bc cup packed brown sugar ", "2 tablespoons honey ", "\\u00bc cup water ", "2 (1-inch thick) bone-in pork chops ", "2 fresh peaches, sliced ", "2 green bell peppers, sliced "], "directions": ["Preheat the oven to 350 degrees F (175 degrees C).", "Melt butter in a medium skillet or saucepan over medium heat. Stir in maple syrup, brown sugar, and honey; bring to a simmer. When glaze is rapidly simmering, turn off heat.", "Pour water into a 9x13-inch baking pan. Place pork chops in the water and surround with peach and bell pepper slices. Slowly pour glaze over chops, peaches, and peppers.", "Bake in the preheated oven, turning halfway, until pork is slightly pink in the center, about 30 minutes. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C)."]}, {"url": "https://www.allrecipes.com/recipe/146819/spooky-witches-fingers/", "name": "Spooky Witches' Fingers", "ingredients": ["1 cup butter, softened ", "1 cup confectioners' sugar ", "1 egg ", "1 teaspoon almond extract ", "1 teaspoon vanilla extract ", "2\\u2009\\u2154 cups all-purpose flour ", "1 teaspoon baking powder ", "1 teaspoon salt ", "\\u00be cup whole almonds ", "1 (.75 ounce) tube red decorating gel "], "directions": ["Combine the butter, sugar, egg, almond extract, and vanilla extract in a mixing bowl. Beat together with an electric mixer; gradually add the flour, baking powder, and salt, continually beating; refrigerate 20 to 30 minutes.", "Preheat oven to 325 degrees F (165 degrees C). Lightly grease baking sheets.", "Remove dough from refrigerator in small amounts. Scoop 1 heaping teaspoon at a time onto a piece of waxed paper. Use the waxed paper to roll the dough into a thin finger-shaped cookie. Press one almond into one end of each cookie to give the appearance of a long fingernail. Squeeze cookie near the tip and again near the center of each to give the impression of knuckles. You can also cut into the dough with a sharp knife at the same points to help give a more finger-like appearance. Arrange the shaped cookies on the baking sheets.", "Bake in the preheated oven until the cookies are slightly golden in color, 20 to 25 minutes.", "Remove the almond from the end of each cookie; squeeze a small amount of red decorating gel into the cavity; replace the almond to cause the gel to ooze out around the tip of the cookie."]}, {"url": "https://www.allrecipes.com/recipe/278356/mexican-chorizo-breakfast-pie/", "name": "Mexican Chorizo Breakfast Pie", "ingredients": ["3 cups frozen shredded hash browns ", "3 large eggs eggs, beaten, divided ", "2 tablespoons minced onion ", "1 tablespoon all-purpose flour ", "1 teaspoon salt ", "1\\u2009\\u00bd tablespoons olive oil ", "1 pound bulk Mexican chorizo sausage ", "1 onion, chopped ", "2 cloves garlic, minced ", "\\u00bc cup milk ", "2 tablespoons chopped fresh cilantro ", "1 teaspoon ground cumin ", "1\\u2009\\u00bd cups shredded Monterey Jack cheese "], "directions": ["Preheat the oven to 400 degrees F (200 degrees C). Grease a 9-inch pie pan.", "Combine hash browns, 1 egg, minced onion, flour, and salt in a bowl. Pour into the prepared pie pan and smooth down to form a crust.", "Bake in the preheated oven for 30 minutes. Brush the crust with olive oil and continue to bake until golden and set, about 10 minutes more. Remove from the oven and reduce temperature to 350 degrees F (175 degrees C).", "Heat a large skillet over medium-high heat. Cook and stir chorizo in the hot skillet until browned and crumbly, 5 to 7 minutes. Add chopped onion and garlic and saute for another 3 minutes. Remove any extra grease from the pan if desired.", "Beat remaining eggs and milk together in a bowl until smooth; add cilantro and cumin.", "Spread half of the Monterey Jack cheese onto the potato crust. Spoon chorizo mixture over and top with remaining Monterey Jack cheese. Pour egg mixture over the top.", "Bake in the preheated oven until eggs are set and the top of the pie is slightly browned, 35 to 40 minutes. Serve warm."]}, {"url": "https://www.allrecipes.com/recipe/281807/shredded-chicken-chili/", "name": "Shredded Chicken Chili", "ingredients": ["4 (15 ounce) cans great northern beans ", "2 (15.25 ounce) cans sweet corn, drained ", "1 (14.5 ounce) can chicken broth ", "4 stalks celery, sliced ", "1 large onion, diced ", "1 medium jalapeno pepper, diced ", "4 cloves garlic, diced ", "2 tablespoons chopped fresh cilantro ", "2 teaspoons ground cumin ", "2 teaspoons ground black pepper ", "1 teaspoon dried oregano ", "2 pounds shredded cooked chicken ", "2 (4 ounce) cans chopped green chiles "], "directions": ["Puree 2 cans of beans in a food processor or blender. Reserve remaining 2 cans.", "Combine corn, chicken broth, celery, onion, jalapeno pepper, garlic, cilantro, cumin, black pepper, and oregano in a large pot over medium-high heat; bring to a boil. Reduce heat to medium and cook for about 20 minutes.", "Stir in blended and whole beans, shredded chicken, and chile peppers. Reduce heat and let simmer, stirring occasionally, for about 15 minutes. Remove from heat and serve."]}, {"url": "https://www.allrecipes.com/recipe/284036/2-ingredient-coconut-ice-cream/", "name": "2-Ingredient Coconut Ice Cream", "ingredients": ["1 (14 ounce) can sweetened condensed milk ", "1 (13.5 ounce) can coconut milk "], "directions": ["Combine sweetened condensed milk and coconut milk in a bowl and whisk to combine. Chill in the refrigerator for 1 hour.", "Pour mixture into an ice cream maker and freeze according to manufacturer's instructions, about 20 minutes. Transfer to an airtight container and freeze until firm, about 4 hours."]}, {"url": "https://www.allrecipes.com/recipe/147064/tex-mex-patty-melts/", "name": "Tex-Mex Patty Melts", "ingredients": ["1 pound ground beef ", "3 tablespoons chili seasoning mix ", "2 chipotle peppers in adobo sauce, minced ", "\\u00bd fluid ounce beer ", "\\u00bc cup mayonnaise ", "1 chipotle pepper in adobo sauce, minced ", "6 (1 ounce) slices white bread ", "6 (1/2 ounce) slices pepperjack cheese "], "directions": ["Mix together the ground beef, chili seasoning mix, 2 minced chipotle peppers with adobo sauce, and the beer in a bowl. Divide the mixture evenly into three patties.", "Stir together the mayonnaise and 1 minced chipotle pepper with adobo sauce in a small bowl. Divide the mixture between the bread slices and spread evenly. Place a slice of pepperjack cheese on top of the mayonnaise mixture on each slice of bread.", "Heat a large skillet over medium-high heat. Cook the patties in the skillet until no longer pink in the center, 5 to 7 minutes each side for well done. Remove each burger to a slice of bread, sandwiching them with the remaining slices.", "Drain the skillet, reserving 2 tablespoons of the grease. Heat the reserved grease in the skillet over medium-high heat. Grill the sandwiches in the skillet until the bread is golden brown and the cheese is melted, 1 to 2 minutes per side."]}, {"url": "https://www.allrecipes.com/recipe/147103/delicious-egg-salad-for-sandwiches/", "name": "Delicious Egg Salad for Sandwiches", "ingredients": ["8 eggs ", "\\u00bd cup mayonnaise ", "1 teaspoon prepared yellow mustard ", "\\u00bc cup chopped green onion ", " salt and pepper to taste ", "\\u00bc teaspoon paprika "], "directions": ["Place egg in a saucepan and cover with cold water. Bring water to a boil and immediately remove from heat. Cover and let eggs stand in hot water for 10 to 12 minutes. Remove from hot water, cool, peel and chop.", "Place the chopped eggs in a bowl, and stir in the mayonnaise, mustard and green onion. Season with salt, pepper and paprika. Stir and serve on your favorite bread or crackers."]}, {"url": "https://www.allrecipes.com/recipe/281196/paulas-dutch-oven-pot-roast/", "name": "Paula's Dutch Oven Pot Roast", "ingredients": ["1 (2 pound) boneless beef chuck roast ", "1 pinch salt and ground black pepper to taste ", "\\u00bc cup all-purpose flour, or as needed ", "\\u00bd cup vegetable oil (such as Wesson\\u00ae) ", "2 (14 ounce) cans beef broth ", "\\u2154 cup dry white wine ", "1 medium onion, chopped ", "1 (1.25 ounce) package beef with onion soup mix ", "1 teaspoon dried marjoram ", "4 dashes Worcestershire sauce ", "2 leaf (blank)s bay leaves ", "2 cups water to cover ", "1 (16 ounce) package baby carrots ", "2 medium potatoes, peeled and quartered, or more to taste "], "directions": ["Season roast with salt and pepper and coat with 2 tablespoons flour. Heat oil in a large 6- to 8-quart Dutch oven. Brown the roast on all sides in the hot oil, 5 to 7 minutes. Stir in remaining flour to absorb remaining oil. Add beef broth, wine, onion, soup mix, marjoram, Worcestershire, and bay leaves. Add enough water to cover.", "Cover and simmer on medium-low heat until tender, about 2 hours. Add carrots and potatoes. Continue to cook until vegetables are tender, about 1 hour. If gravy is too thin, uncover and continue to simmer until liquid evaporates and gravy thickens, about 20 minutes more. Remove bay leaves from gravy when serving."]}, {"url": "https://www.allrecipes.com/recipe/278254/apple-and-cheddar-skillet-cake/", "name": "Apple and Cheddar Skillet Cake", "ingredients": ["1 cup butter ", "1\\u2009\\u00bd cups white sugar, divided ", "6 each Granny Smith apples - peeled, cored, and diced ", "2 teaspoons ground cinnamon ", "2 teaspoons ground nutmeg ", "2 cups baking mix (such as Jiffy\\u00ae) ", "1 cup milk ", "6 ounces shredded sharp white Cheddar cheese "], "directions": ["Preheat the oven to 350 degrees F (175 degrees C).", "Combine butter and 1 1/4 cups sugar in a 9-inch oven-safe skillet over medium heat. Cook and stir until sugar dissolves and mixture begins to caramelize, 5 to 10 minutes. When mixture starts to simmer, add diced apples and sprinkle with cinnamon and nutmeg. Gently press on the apples with a spatula until coated with sugar mixture and simmer, without stirring, until they begin to soften, about 5 minutes.", "Combine baking mix, milk, shredded Cheddar cheese, and remaining 1/4 cup sugar in a bowl and stir until consistency is similar to a waffle batter. Spoon mixture evenly over the apples in the skillet; no need to be too precise as it will spread out while baking.", "Bake skillet in preheated oven until batter reaches a firm consistency and is golden brown, 20 to 25 minutes. Remove from the oven and allow to cool on the stovetop until the caramelized sugar thickens a bit, about 5 minutes. Spoon servings onto individual plates, drizzle with caramel liquid, and serve while warm."]}, {"url": "https://www.allrecipes.com/recipe/286324/strawberry-banana-bread-with-walnuts/", "name": "Strawberry-Banana Bread with Walnuts", "ingredients": ["1 tablespoon butter ", "4 large eggs ", "1 cup white sugar ", "1 cup mashed strawberries ", "1 cup mashed bananas ", "1 cup strawberry yogurt ", "\\u00bd cup rolled oats ", "\\u00bd cup canola oil ", "\\u00bd cup applesauce ", "\\u00bd teaspoon vanilla extract ", "3 cups all-purpose flour ", "1 teaspoon baking soda ", "1 teaspoon ground cinnamon ", "\\u00bd teaspoon salt ", "\\u00bc teaspoon ground nutmeg ", "1 cup chopped walnuts "], "directions": ["Preheat the oven to 350 degrees F (175 degrees C). Grease two 8.5x4.5-inch loaf pans and one 5.75x3-inch mini loaf pan with butter.", "Lightly beat eggs in a large bowl with an electric mixer. Add sugar, strawberries, bananas, yogurt, oats, oil, applesauce, and vanilla and beat until well combined. Let sit for 5 minutes to soak oats.", "Add flour, baking soda, cinnamon, salt, and nutmeg to the strawberry-banana mixture, beating just until combined. Stir in walnuts. Pour batter into the prepared pans.", "Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 40 minutes for mini loaf and 1 hour for larger loaves."]}, {"url": "https://www.allrecipes.com/recipe/282728/chinese-spareribs-with-pineapple/", "name": "Chinese Spareribs with Pineapple", "ingredients": ["1 pound pork spareribs ", "5 tablespoons water ", "3 tablespoons white vinegar ", "2 tablespoons white sugar ", "2 tablespoons light soy sauce ", "2 tablespoons dark soy sauce ", "1 tablespoon dry white wine ", "1 (8 ounce) can sliced pineapple "], "directions": ["Cut ribs into small pieces.", "Heat a medium nonstick pot over medium-high heat. Sear ribs in the hot pot on all sides, about 5 minutes.", "Whisk water, vinegar, sugar, both soy sauces, and wine together in a small bowl. Pour over ribs and reduce heat to medium-low. Add pineapple rings. Let stew until liquid evaporates and ribs are tender, about 1 hour. Don't let all the sauce dry up completely.", "Serve ribs with pineapple rings."]}, {"url": "https://www.allrecipes.com/recipe/286188/ahi-tuna-tacos-with-pineapple-salsa/", "name": "Ahi Tuna Tacos with Pineapple Salsa", "ingredients": ["2 tablespoons ground black pepper ", "2 teaspoons salt ", "2 teaspoons ground cumin ", "2 teaspoons garlic powder ", "2 teaspoons ground cinnamon ", "1 pound ahi tuna steaks ", "2 tablespoons olive oil ", "4 tablespoons fat-free sour cream ", "4 (10 inch) flour tortillas, warmed ", "\\u00bd whole fresh pineapple - peeled, cored, and diced ", "\\u00bd medium red onion, diced ", "2 tablespoons chopped fresh cilantro, or to taste ", "2 tablespoons lime juice ", "1 tablespoon crushed red pepper ", "2 teaspoons grated lime zest "], "directions": ["Mix black pepper, salt, cumin, garlic powder, and cinnamon together in a small bowl. Rub all over tuna steaks. Cover and refrigerate for at least 15 minutes.", "Meanwhile, stir pineapple, red onion, cilantro, lime juice, red pepper, and lime zest for salsa together in a bowl until combined. Cover and refrigerate until needed.", "Heat oil in a cast iron skillet over medium heat. Add tuna steaks and cook to desired doneness, 1 1/2 to 2 minutes per side. An instant-read thermometer inserted into the center should read 140 degrees F (60 degrees C) for medium doneness. Remove from the skillet and slice steaks thinly.", "Spread sour cream in a thin layer over each warmed tortilla. Add tuna slices, top with pineapple salsa, and wrap to seal."]}, {"url": "https://www.allrecipes.com/recipe/283984/garlic-butter-rice-and-veggies/", "name": "Garlic Butter Rice and Veggies", "ingredients": ["2 cups water ", "1 cup uncooked white rice ", "6 tablespoons salted butter, or more to taste ", "1 medium onion, minced ", "2 tablespoons minced garlic ", "\\u00bd pound bacon, chopped ", "1 (8 ounce) package frozen peas and corn ", " salt and ground black pepper to taste "], "directions": ["Bring water and rice to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until rice is tender and water has been absorbed, 20 to 25 minutes. Remove from the heat and cool to room temperature, about 30 minutes. Refrigerator 8 hours to overnight.", null, "Add cold rice and stir until rice is completely coated in butter. Season with salt and pepper and cook until heated through, about 5 minutes."]}, {"url": "https://www.allrecipes.com/recipe/282040/sour-cream-peach-crumble-pie/", "name": "Sour Cream Peach Crumble Pie", "ingredients": ["1 (14.1 ounce) package refrigerated dough for a double-crust pie, defrosted ", "5 medium (blank)s fresh peaches - peeled, pitted, and sliced ", "1 cup sour cream ", "\\u00be cup white sugar ", "\\u2153 cup all-purpose flour ", "\\u00bd teaspoon vanilla extract ", "\\u00bc teaspoon ground nutmeg ", "6 tablespoons all-purpose flour ", "\\u00bc cup brown sugar ", "\\u00bc teaspoon ground cinnamon ", "3 tablespoons unsalted butter, cut into pieces "], "directions": ["Preheat the oven to 425 degrees F (220 degrees C).", "Unroll 1 pie crust and place in a 9-inch pie plate. Roll the second crust on a lightly floured surface to a 12-inch circle and cut into even strips; set aside.", "Combine peaches, sour cream, sugar, flour, vanilla extract, and nutmeg for pie in a bowl; toss to combine. Pour into the pie crust.", "Combine flour, brown sugar, and cinnamon for the topping in a small bowl. Cut in the butter with a pastry blender or 2 knives until crumbly. Sprinkle over the peaches.", "Weave reserved crust strips into a lattice and place on top of crumb topping. Cover crust edges with aluminum foil.", "Bake in the preheated oven for 30 minutes. Remove foil and bake until filling is bubbly and crust is golden brown, about 10 minutes longer."]}, {"url": "https://www.allrecipes.com/recipe/282842/grilled-chicken-with-peach-salsa/", "name": "Grilled Chicken with Peach Salsa", "ingredients": ["1 (5 ounce) skinless, boneless chicken breast half ", "1 teaspoon olive oil ", "1 teaspoon balsamic vinegar ", "1 tablespoon brown sugar ", "1 cup diced fresh peaches ", "1 cup diced tomato ", "\\u00bd cup sliced, seedless grapes ", "\\u00bd cup diced red onion ", "1 tablespoon lemon juice ", "1 tablespoon honey "], "directions": ["Preheat an outdoor grill for medium heat and lightly oil the grate.", "Rub chicken breast with olive oil and vinegar, then rub brown sugar onto the chicken until you've got a nice glaze coat.", "Grill chicken on the preheated grill until no longer pink in the center and the juices run clear, about 5 minutes per side; be careful not to let the brown sugar stick to the grill. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).", "While the chicken is cooking, combine peaches, tomato, grapes, onion, lemon juice, and honey in a bowl; mix thoroughly.", "Dice the cooked chicken and serve on top of the salsa."]}, {"url": "https://www.allrecipes.com/recipe/285965/easy-strawberry-crumble/", "name": "Easy Strawberry Crumble", "ingredients": ["2\\u2009\\u00bd cups biscuit baking mix, divided ", "\\u00bc cup white sugar ", "\\u00be cup milk ", "1 large egg ", "2 cups sliced fresh strawberries ", "\\u00bd cup brown sugar ", "\\u00bc cup unsalted butter, softened "], "directions": ["Preheat the oven to 400 degrees F (200 degrees C). Grease a 9-inch square baking pan.", "Combine 2 cups biscuit mix with white sugar. Stir in milk and egg and beat with an electric mixer until well combined. Pour mixture into the prepared baking pan and spread sliced strawberries over top.", "Combine remaining 1/2 cup biscuit mix with brown sugar. Add softened butter and stir with a fork until crumbly. Spread topping over the strawberries.", "Bake in the preheated oven until golden brown, about 40 minutes."]}, {"url": "https://www.allrecipes.com/recipe/148555/whole-wheat-sweet-potato-muffins/", "name": "Whole Wheat Sweet Potato Muffins", "ingredients": ["1 sweet potato ", "2 cups whole wheat flour ", "1 teaspoon baking soda ", "\\u00bd teaspoon salt ", "1 teaspoon ground cinnamon ", "\\u00bc teaspoon ground nutmeg ", "\\u00bc teaspoon ground ginger ", "\\u00bc teaspoon ground cloves ", "\\u00bc cup vegetable oil ", "2 eggs, lightly beaten ", "1 teaspoon vanilla extract ", "1 cup honey ", "1 (6 ounce) container vanilla yogurt ", "\\u00bd cup oatmeal ", "\\u00bd cup brown sugar ", "\\u00bd cup almonds ", "1 teaspoon cinnamon "], "directions": ["Preheat an oven to 400 degrees F (200 degrees C). Grease 16 muffin cups, or line with paper muffin liners; set aside. Prick sweet potato several times with a fork and place onto a baking sheet.", "Bake the sweet potato in the preheated oven until easily pierced with a fork, about 40 minutes. When the potato is cool enough to handle, peel and mash.", "Reduce the oven temperature to 350 degrees F (175 degrees C).", "Whisk together the flour, baking soda, salt, the 1 teaspoon cinnamon, nutmeg, ginger, and cloves. Stir in the vegetable oil, eggs, vanilla, honey, yogurt, and mashed sweet potato, just until all ingredients are moistened. Spoon batter evenly into prepared muffin cups.", "Blend together the oatmeal, brown sugar, almonds, and the remaining 1 teaspoon cinnamon in a food processor or blender. Sprinkle topping over unbaked muffins.", "Bake muffins in the preheated oven until golden and the tops spring back when lightly pressed, 12 to 15 minutes."]}, {"url": "https://www.allrecipes.com/recipe/283028/mustard-sauce-for-corned-beef/", "name": "Mustard Sauce for Corned Beef", "ingredients": ["1\\u2009\\u00bd tablespoons salted butter ", "1 large egg ", "\\u2153 cup brown sugar ", "\\u00bc cup white sugar ", "\\u00bc cup prepared yellow mustard ", "\\u00bc teaspoon salt ", "\\u215b teaspoon ground black pepper ", "\\u00be cup cider vinegar "], "directions": ["Melt butter in a saucepan over low heat; remove from heat.", "Whisk egg, brown sugar, white sugar, mustard, salt, and pepper together in a small bowl. Whisk in vinegar. Stir mixture into the melted butter.", "Stir sauce over medium heat until boiling. Reduce heat and simmer for 3 minutes longer."]}, {"url": "https://www.allrecipes.com/recipe/148818/grilled-tequila-lime-shrimp/", "name": "Grilled Tequila-Lime Shrimp", "ingredients": ["2 tablespoons lime juice ", "2 tablespoons tequila ", "\\u00bc cup olive oil ", "1 pinch garlic salt ", "1 pinch ground cumin ", " ground black pepper to taste ", "1 pound large shrimp, peeled and deveined ", "6 (10 inch) wooden skewers ", "1 large lime, quartered "], "directions": ["Whisk together the lime juice, tequila, olive oil, garlic salt, cumin, and black pepper in a bowl until well blended. Pour into a large resealable plastic bag; add the shrimp, seal bag and turn to coat evenly. Refrigerate 1 to 4 hours before grilling.", "Soak skewers at least 30 minutes in water to prevent burning.", "Preheat outdoor grill for medium-high heat. Lightly oil grill grate, and place about 4 inches from heat source.", "Drain and discard marinade from shrimp. Thread shrimp onto prepared skewers, 5 to 6 per skewer.", "Cook, uncovered, on preheated grill until shrimp turn pink, turning once, for 5 to 7 minutes. Serve with lime wedges for garnish."]}, {"url": "https://www.allrecipes.com/recipe/149064/kelloggs-chocolate-scotcheroos/", "name": "Kellogg's\\u00ae Chocolate Scotcheroos", "ingredients": ["1 cup light corn syrup ", "1 cup sugar ", "1 cup peanut butter ", "6 cups Kellogg's\\u00ae Rice Krispies\\u00ae cereal or Kellogg's\\u00ae Cocoa Krispies\\u2122 cereal ", "1 cup semi-sweet chocolate morsels ", "1 cup butterscotch chips "], "directions": ["Place corn syrup and sugar into 3-quart saucepan. Cook over medium heat, stirring frequently, until sugar dissolves and mixture begins to boil. Remove from heat. Stir in peanut butter. Mix well. Add Kellogg's\\u00ae Rice Krispies\\u00ae cereal. Stir until well coated. Press mixture into 13 x 9 x 2-inch pan coated with cooking spray. Set aside.", "Melt chocolate and butterscotch chips together in 1-quart saucepan over low heat, stirring constantly. Spread evenly over cereal mixture. Let stand until firm. Cut into 2 x 1-inch bars when cool."]}]}